# Словари:
# 1. Создайте словарь, связав его с переменной school, и наполните его данными,
# которые бы отражали количество учащихся в десяти разных классах (например, 1а, 1б,
# 2б, 6а, 7в и т.д.).
school = {'1a': 28, "1б": 13, "2а": 15, "2в": 40, "3а": 21, "3б": 26, "4а": 35, "4б": 21, "5а": 10,
          "5б": 40, "6а": 323, "6б": 28, "7а": 29, "7б": 19, "8а": 26, "8б": 31, "9а": 24, "9б": 21,
          "10а": 25, "10б": 210}


# 2. Узнайте сколько человек в каком-нибудь классе.
def x():
    """
    Returns class
    """
    return school['40']


print(x())


# 3. Представьте, что в школе произошли изменения, внесите их в словарь:
# ◦ в трех классах изменилось количество учащихся;
def change():
    """
    Change classes value
    """
    school["1а"] = 32
    school["4а"] = 13
    school["9а"] = 30
    return school


print(change())


# ◦ в школе появилось два новых класса;
def add_clas():
    """
    Add classes
    """
    school["5c"] = 30
    school["1c"] = 26
    return school


print(add_clas())


# ◦ в школе расформировали один из классов.
def remove_clas():
    """
    Remove clas
    """
    school.pop("8а")
    return school


print(remove_clas())


# 4. Выведите содержимое словаря на экран.
def our_school():
    """
    Returns school
    """
    return school


print(our_school())
